{"basics":{"name":"Alberto Espinosa de los Monteros","label":"Computer Science Student","email":"alberto.espinosa@colorado.edu","phone":"+1 970 771 6665","summary":"A passionate Computer Science student at the University of Colorado Boulder, specializing in software development, robotics, embedded systems, data science, and computer architecture. With a diverse skill set and hands-on project experience, I am eager to apply my knowledge in the professional world.","location":{"city":"Boulder","region":"Colorado","countryCode":"US"}},"education":[{"institution":"University of Colorado Boulder","area":"Computer Science | GPA: 3.486/4.0","studyType":"Bachelors of Science","startDate":"2020-08-26","endDate":"2025-05-01","courses":["Minor in Business","Minor in Computer Engineering"]}],"skills":[{"name":"Languages","level":"","keywords":["C/C++ (Proficient)","Python (Proficient)","Java (Intermediate)","Scala (Intermediate)","Verilog (Beginner)","Swift (Beginner)","CodAL (Proficient)"]},{"name":"Web Development & Development Tools","level":"","keywords":["HTML5, CSS3, React.js, Angular, Bootstrap, AJAX, JavaScript","Git, Jenkins, Docker, JIRA, Agile, UML, Docker, Kubernetes, AWS"]},{"name":"Machine Learning, Analytics & Databases","level":"","keywords":["Scikit-learn, OpenCV, TensorFlow, PyTorch","NumPy, Scipy, Pandas, Seaborn, Matplotlib","MySQL, PostgreSQL, Cassandra, MongoDB"]},{"name":"Networking","level":"","keywords":["Routing Protocols: BGP, OSPF, ECMP, MPLS","Networking: LAN/WAN, TCP/IP, UDP, IPv4/IPv6, DNS/DHCP, ARP, NAT, and DHT","Network Security Protocols: TLS, PGP, IPSec, Encryption, Auth","Algorithms: VPN configuration, TCP congestion control, Firewalls (Forward/Reverse Proxy), BDP"]},{"name":"Embedded & Robotics Frameworks","level":"","keywords":["RTOS","Microcontrollers (ARM Cortex-M4, STM32)","3D CAD design (Solidworks)","UART/USART/SPI/I2C","ROS (Webots)","CodAL (RISC-V ISA)","ADAS technologies (LiDAR, Radar, Computer Vision, RRT, ML, SLAM, IK)"]}],"projects":[{"name":"Fully Autonomous Robot in Python","position":"Programmer","location":"Boulder, CO","startDate":"2023-08-01","endDate":"2023-12-01","summary":"Programmed a TIAGo Robot to autonomously scan, map, and retrieve objects from a simulated 3D supermarket using LiDAR-based mapping.","highlights":["Achieved 90% accuracy in LiDAR-based mapping.","Developed a 2D map representation for navigation and path planning.","Implemented Color Blob Detection for object identification.","Applied RRT algorithm for optimal path computation.","Controlled the robot's arm using Inverse Kinematics for object retrieval."]},{"name":"Machine Learning for Disaster Relief in Python","position":"Project Manager & Lead Developer","location":"Boulder, CO","startDate":"2024-08-31","endDate":"2024-12-16","summary":"To use historical disaster data from the EM-DAT database to predict at-risk regions and optimize disaster relief resource allocation. The project focused on analyzing disaster types, severity, and their impacts to guide data-driven decision-making.","highlights":["Applied a comprehensive exploratory data analysis (EDA) on EM-DAT dataset to identify critical features and patterns.","Implemented machine learning models (Random Forests, Gradient Boosting, SVM) to predict disaster risk and optimize resource allocation using EM-DAT historical data.","Achieved 60% accuracy with Gradient Boosting Classifier for disaster severity prediction; identified key factors like affected population and disaster duration.","Conducted data preprocessing, feature selection, and class balancing to improve model performance and highlight disaster trends for resource planning."]},{"name":"EDA on Smoking Habits in the UK in Python","position":"Data Science","location":"Boulder, CO","startDate":"2023-05-01","endDate":"2023-08-01","summary":"Conducted exploratory data analysis on smoking habits using Python, uncovering insights on categorical and numerical variables.","highlights":["Cleaned and pre-processed large datasets.","Performed univariate and multivariate analysis.","Visualized relationships using NumPy, Pandas, Seaborn, and Matplotlib.","Delivered statistical insights on smoking trends."]},{"name":"STM32 Board Project in C++","position":"Embedded Systems Developer","location":"Boulder, CO","startDate":"2024-01-01","endDate":"2024-05-01","summary":"Developed a Tic-Tac-Toe game on the STM32F429i Discovery Board, integrating peripherals via HAL, external interrupts, and timers.","highlights":["Designed an intuitive user interface for the game.","Created an AI opponent with RNG-based logic.","Optimized the system using STM32CubeIDE."]},{"name":"UDP Client-Server Connection in C","position":"Systems Developer","location":"Boulder, CO","startDate":"2024-01-01","endDate":"2024-05-01","summary":"Developed a UDP-based client-server system replicating core FTP functionalities, enabling file management.","highlights":["Implemented reliable UDP communication with packet retransmission and error handling.","Optimized file transmission for large files."]},{"name":"RISC-V ISA Processor Modeling in CodAL","position":"Computer Architect","location":"Boulder, CO","startDate":"2024-01-01","endDate":"2024-05-01","summary":"Modeled instruction-accurate RISC-V processor with core instructions, pipeline forwarding logic, and memory operations.","highlights":["Resolved data hazards using pipeline forwarding.","Ensured cycle-accurate models for performance-critical operations."]},{"name":"Multi-Threaded Application in C++","position":"Programmer","location":"Boulder, CO","startDate":"2023-08-01","endDate":"2023-12-01","summary":"Built a multi-threaded C application to resolve domain names to IP addresses using socket programming.","highlights":["Designed a producer-consumer system for processing input files with individual threads.","Utilized mutexes, semaphores, and condition variables to synchronize threads and ensure thread-safe access."]},{"name":"TCP-Based Web Server in C","position":"Systems Developer","location":"Boulder, CO","startDate":"2024-01-01","endDate":"2024-05-01","summary":"Created a TCP-based, multi-threaded web server capable of handling simultaneous client requests.","highlights":["Implemented HTTP request parsing and response handling.","Used thread synchronization to manage concurrent requests efficiently."]},{"name":"HTTP Proxy Server in C++","position":"Systems Developer","location":"Boulder, CO","startDate":"2024-01-01","endDate":"2024-05-01","summary":"Designed and implemented an HTTP proxy server to relay client HTTP requests and forward responses.","highlights":["Built caching mechanisms to improve performance and reduce bandwidth usage.","Implemented content filtering and transformation for client requests."]},{"name":"Distributed File System (DFS) in C++","position":"Systems Developer","location":"Boulder, CO","startDate":"2024-01-01","endDate":"2024-05-01","summary":"Developed a distributed file system (DFS) with redundancy for secure file storage across servers.","highlights":["Implemented file chunking and redundant storage for 100% file recovery.","Handled client-server communication for file upload/download with fault tolerance."]}],"volunteer":[{"organization":"Society of Hispanic Professional Engineers","position":"BOLD Scholar","location":"Boulder, CO","startDate":"2020-08-01","summary":"Participated in workshops and networking events to promote professional development among Hispanic students in STEM."},{"organization":"CU Boulder Men's Rugby","position":"Division 1 Rugby Player","location":"Boulder, CO","startDate":"2021-08-01","endDate":"2026-05-15","summary":"Demonstrated leadership, teamwork, and discipline as a committed player in Division 1 Rugby, contributing to both practice and game strategies. Played Outside Center (13) for 15s."},{"organization":"University of Colorado Boulder","position":"Learning Assistant","location":"Boulder, CO","startDate":"2021-08-01","endDate":"2021-12-01","summary":"Held weekly office hours (6 hrs/week) to provide academic support to peers, helping them understand challenging C++ topics. Facilitated collaborative learning and encouraged problem-solving by breaking down complex concepts."},{"organization":"Summit High School","position":"Football Team Captain","location":"Breckenridge, CO","startDate":"2018-08-01","endDate":"2020-06-01","summary":"Led the football team by organizing and conducting weekly practice drills, focusing on core skills development. Implemented a mentorship program pairing freshmen with seniors to promote team unity and leadership."},{"organization":"The Peak School","position":"Volunteer at Timberline Adult Day Care Services","location":"Breckenridge, CO","startDate":"2018-09-26","endDate":"2019-06-15","summary":"Was part of a small group of selected students that was part of the Intergenerational Story Telling Project."},{"organization":"Bucaneros de Satelite & Snow Tigers","position":"Youth Football Coach","location":"Mexico City","startDate":"2015-09-26","endDate":"2019-08-23","summary":"Formed part of the coaching staff for the youth football team for kids 9 to 10 years old."}],"interests":[{"name":"Football","keywords":["I played football for 8 years of my life, from 8 years old, until I was 18","Got the opportunity to represent my country on an international U-15 game","I got the privilage of being named Captian for the Summit Tigers Football team in highschool.","I played inside linebacker, running back, and special teams."]},{"name":"Reading","keywords":["Enjoy reading non-fiction books. My top reads in the past few years: "," - Antifragile by Nassim Nicholas Taleb"," - The Book of Five Rings by Miyamoto Musashi"," - The Order of Time by Carlo Rovelli"," - Siddharta by Hermann Hesse"," - Epistulae Morales ad Lucilium by Seneca"," - Into the Magic Shop by James R. Doty"," - Why We Sleep by Mathew Walker"," - Shoe Dog by Phil Knight"]},{"name":"Rugby","keywords":["I got the opportunity to play for Division 1, CU Rugby team here in Boulder.","I played two seasons during my sophomore year in college, suffering a concussion at the end of the second one.","After which, I decided it was time to hang the boots for good and take care of my brain.","My postion was outside center and left wing."]},{"name":"Exercise","keywords":["Enjoy lifting weights at least 4 times a week, and go for a long run every Sunday morning.","This habit has brought several side effects into my life:"," - Practice and strengthen my discipline by performing actions that provide immideate discomfort and delayed gratification."," - Helped me develop healthier habits in my life, such as eating a clean diet, and going to bet in time for effective recovery."]}]}